export default [
    [
        {
            data: [
                { name: '识记型', value: 5 },
                { name: '理解型', value: 6 },
                { name: '应用型', value: 10 },
                { name: '分析型', value: 8 },
                { name: '评价型', value: 5 },
                { name: '创新型', value: 2 }
            ]
        },{
            dataset: {
                dimensions: ['product', '集体应答', '个别应答'],
                source: [
                    ['创新型', 1,2,3],
                    ['评价型', 3,4,5],
                    ['理解型', 1,3,5],
                    ['分析型', 1,4,5],
                    ['应用型', 2,3,5],
                    ['识记型', 2,6,5],
                ]
            }
        },{
            series: {
                data: [
                    { value: 1548, name: '补充' },
                    { value: 775, name: '表扬' },
                ]
            },
            data: [
                { value: 9, name: '表扬补充' },
                { value: 27, name: '老师补充' },
                { value: 9, name: '倾听表扬' },
                { value: 55, name: '简单表扬' },
            ]
        },{
            data: [
                { name: '听讲', value: 4 },
                { name: '举手', value: 6 },
                { name: '操作', value: 8 },
                { name: '分神', value: 10 },
                { name: '回答', value: 11 },
                { name: '读写', value: 15 },
                { name: '趴桌', value: 3 },
                { name: '讨论', value: 4 },
            ]
        },{
            data: [
                { name: '0-40%', value: 5 },
                { name: '40-60%', value: 5 },
                { name: '60-80%', value: 5 },
                { name: '80-90%', value: 10 },
                { name: '90%以上', value: 45 },
            ]
        },{
            xAxis: {
                data: ['2', '4', '6', '8', '10', '12', '14', '16', '18', '20', '22', '24', '26', '28', '30', '32', '34', '36', '38', '40']
            },
            series: [
                {
                    name: '参与度',
                    data: [120, 132, 101, 134, 90, 230, 210, 220, 182, 191, 234, 290, 330, 310, 150, 232, 201, 154, 190, 330, 410]
                },{
                    name: '凝聚度',
                    data: [220, 182, 191, 234, 290, 330, 310, 120, 132, 101, 134, 90, 230, 210, 150, 232, 201, 154, 190, 330, 410]
                },{
                    name: '专业度',
                    data:  [150, 232, 201, 154, 190, 330, 410, 120, 132, 101, 134, 90, 230, 210, 220, 182, 191, 234, 290, 330, 310]
                }
            ]
        },
        [{
            report: `
            总体来看，这节课的提问策略较为平衡，既注重基础认知问题，也涉及高级认知问题。学生的行为分析显示，大部分学生在课堂上表现出较高的专注度和参与度。然而，举手行为较少，可能需要教师采取措施鼓励学生更加积极地参与课堂互动。同时，课堂参与度/凝聚度/专注度的变化情况需要更多数据来进一步分析。
            `
        }]
    ],

    [
        {
            data: [
                { name: '识记型', value: 5 },
                { name: '理解型', value: 6 },
                { name: '应用型', value: 10 },
                { name: '分析型', value: 8 },
                { name: '评价型', value: 5 },
                { name: '创新型', value: 2 }
            ]
        },{
            dataset: {
                dimensions: ['product', '集体应答', '个别应答'],
                source: [
                    ['创新型', 1,2,3],
                    ['评价型', 3,4,5],
                    ['理解型', 1,3,5],
                    ['分析型', 1,4,5],
                    ['应用型', 2,3,5],
                    ['识记型', 2,6,5],
                ]
            }
        },{
            series: {
                data: [
                    { value: 1548, name: '补充' },
                    { value: 775, name: '表扬' },
                ]
            },
            data: [
                { value: 9, name: '表扬补充' },
                { value: 27, name: '老师补充' },
                { value: 9, name: '倾听表扬' },
                { value: 55, name: '简单表扬' },
            ]
        },{
            data: [
                { name: '听讲', value: 4 },
                { name: '举手', value: 6 },
                { name: '操作', value: 8 },
                { name: '分神', value: 10 },
                { name: '回答', value: 11 },
                { name: '读写', value: 15 },
                { name: '趴桌', value: 3 },
                { name: '讨论', value: 4 },
            ]
        },{
            data: [
                { name: '0-40%', value: 5 },
                { name: '40-60%', value: 5 },
                { name: '60-80%', value: 5 },
                { name: '80-90%', value: 10 },
                { name: '90%以上', value: 45 },
            ]
        },{
            xAxis: {
                data: ['2', '4', '6', '8', '10', '12', '14', '16', '18', '20', '22', '24', '26', '28', '30', '32', '34', '36', '38', '40']
            },
            series: [
                {
                    name: '参与度',
                    data: [120, 132, 101, 134, 90, 230, 210, 220, 182, 191, 234, 290, 330, 310, 150, 232, 201, 154, 190, 330, 410]
                },{
                    name: '凝聚度',
                    data: [220, 182, 191, 234, 290, 330, 310, 120, 132, 101, 134, 90, 230, 210, 150, 232, 201, 154, 190, 330, 410]
                },{
                    name: '专业度',
                    data:  [150, 232, 201, 154, 190, 330, 410, 120, 132, 101, 134, 90, 230, 210, 220, 182, 191, 234, 290, 330, 310]
                }
            ]
        },
        [{
            report: `
            总体来看，这节课的提问策略较为平衡，既注重基础认知问题，也涉及高级认知问题。学生的行为分析显示，大部分学生在课堂上表现出较高的专注度和参与度。然而，举手行为较少，可能需要教师采取措施鼓励学生更加积极地参与课堂互动。同时，课堂参与度/凝聚度/专注度的变化情况需要更多数据来进一步分析。
            `
        }]
    ],

    [
        {
            data: [
                { name: '识记型', value: 5 },
                { name: '理解型', value: 6 },
                { name: '应用型', value: 10 },
                { name: '分析型', value: 8 },
                { name: '评价型', value: 5 },
                { name: '创新型', value: 2 }
            ]
        },{
            dataset: {
                dimensions: ['product', '集体应答', '个别应答'],
                source: [
                    ['创新型', 1,2,3],
                    ['评价型', 3,4,5],
                    ['理解型', 1,3,5],
                    ['分析型', 1,4,5],
                    ['应用型', 2,3,5],
                    ['识记型', 2,6,5],
                ]
            }
        },{
            series: {
                data: [
                    { value: 1548, name: '补充' },
                    { value: 775, name: '表扬' },
                ]
            },
            data: [
                { value: 9, name: '表扬补充' },
                { value: 27, name: '老师补充' },
                { value: 9, name: '倾听表扬' },
                { value: 55, name: '简单表扬' },
            ]
        },{
            data: [
                { name: '听讲', value: 4 },
                { name: '举手', value: 6 },
                { name: '操作', value: 8 },
                { name: '分神', value: 10 },
                { name: '回答', value: 11 },
                { name: '读写', value: 15 },
                { name: '趴桌', value: 3 },
                { name: '讨论', value: 4 },
            ]
        },{
            data: [
                { name: '0-40%', value: 5 },
                { name: '40-60%', value: 5 },
                { name: '60-80%', value: 5 },
                { name: '80-90%', value: 10 },
                { name: '90%以上', value: 45 },
            ]
        },{
            xAxis: {
                data: ['2', '4', '6', '8', '10', '12', '14', '16', '18', '20', '22', '24', '26', '28', '30', '32', '34', '36', '38', '40']
            },
            series: [
                {
                    name: '参与度',
                    data: [120, 132, 101, 134, 90, 230, 210, 220, 182, 191, 234, 290, 330, 310, 150, 232, 201, 154, 190, 330, 410]
                },{
                    name: '凝聚度',
                    data: [220, 182, 191, 234, 290, 330, 310, 120, 132, 101, 134, 90, 230, 210, 150, 232, 201, 154, 190, 330, 410]
                },{
                    name: '专业度',
                    data:  [150, 232, 201, 154, 190, 330, 410, 120, 132, 101, 134, 90, 230, 210, 220, 182, 191, 234, 290, 330, 310]
                }
            ]
        },
        [{
            report: `
            总体来看，这节课的提问策略较为平衡，既注重基础认知问题，也涉及高级认知问题。学生的行为分析显示，大部分学生在课堂上表现出较高的专注度和参与度。然而，举手行为较少，可能需要教师采取措施鼓励学生更加积极地参与课堂互动。同时，课堂参与度/凝聚度/专注度的变化情况需要更多数据来进一步分析。
            `
        }]
    ],

    [
        {
            data: [
                { name: '识记型', value: 5 },
                { name: '理解型', value: 6 },
                { name: '应用型', value: 10 },
                { name: '分析型', value: 8 },
                { name: '评价型', value: 5 },
                { name: '创新型', value: 2 }
            ]
        },{
            dataset: {
                dimensions: ['product', '集体应答', '个别应答'],
                source: [
                    ['创新型', 1,2,3],
                    ['评价型', 3,4,5],
                    ['理解型', 1,3,5],
                    ['分析型', 1,4,5],
                    ['应用型', 2,3,5],
                    ['识记型', 2,6,5],
                ]
            }
        },{
            series: {
                data: [
                    { value: 1548, name: '补充' },
                    { value: 775, name: '表扬' },
                ]
            },
            data: [
                { value: 9, name: '表扬补充' },
                { value: 27, name: '老师补充' },
                { value: 9, name: '倾听表扬' },
                { value: 55, name: '简单表扬' },
            ]
        },{
            data: [
                { name: '听讲', value: 4 },
                { name: '举手', value: 6 },
                { name: '操作', value: 8 },
                { name: '分神', value: 10 },
                { name: '回答', value: 11 },
                { name: '读写', value: 15 },
                { name: '趴桌', value: 3 },
                { name: '讨论', value: 4 },
            ]
        },{
            data: [
                { name: '0-40%', value: 5 },
                { name: '40-60%', value: 5 },
                { name: '60-80%', value: 5 },
                { name: '80-90%', value: 10 },
                { name: '90%以上', value: 45 },
            ]
        },{
            xAxis: {
                data: ['2', '4', '6', '8', '10', '12', '14', '16', '18', '20', '22', '24', '26', '28', '30', '32', '34', '36', '38', '40']
            },
            series: [
                {
                    name: '参与度',
                    data: [120, 132, 101, 134, 90, 230, 210, 220, 182, 191, 234, 290, 330, 310, 150, 232, 201, 154, 190, 330, 410]
                },{
                    name: '凝聚度',
                    data: [220, 182, 191, 234, 290, 330, 310, 120, 132, 101, 134, 90, 230, 210, 150, 232, 201, 154, 190, 330, 410]
                },{
                    name: '专业度',
                    data:  [150, 232, 201, 154, 190, 330, 410, 120, 132, 101, 134, 90, 230, 210, 220, 182, 191, 234, 290, 330, 310]
                }
            ]
        },
        [{
            report: `
            总体来看，这节课的提问策略较为平衡，既注重基础认知问题，也涉及高级认知问题。学生的行为分析显示，大部分学生在课堂上表现出较高的专注度和参与度。然而，举手行为较少，可能需要教师采取措施鼓励学生更加积极地参与课堂互动。同时，课堂参与度/凝聚度/专注度的变化情况需要更多数据来进一步分析。
            `
        }]
    ],

    [
        {
            data: [
                { name: '识记型', value: 5 },
                { name: '理解型', value: 6 },
                { name: '应用型', value: 10 },
                { name: '分析型', value: 8 },
                { name: '评价型', value: 5 },
                { name: '创新型', value: 2 }
            ]
        },{
            dataset: {
                dimensions: ['product', '集体应答', '个别应答'],
                source: [
                    ['创新型', 1,2,3],
                    ['评价型', 3,4,5],
                    ['理解型', 1,3,5],
                    ['分析型', 1,4,5],
                    ['应用型', 2,3,5],
                    ['识记型', 2,6,5],
                ]
            }
        },{
            series: {
                data: [
                    { value: 1548, name: '补充' },
                    { value: 775, name: '表扬' },
                ]
            },
            data: [
                { value: 9, name: '表扬补充' },
                { value: 27, name: '老师补充' },
                { value: 9, name: '倾听表扬' },
                { value: 55, name: '简单表扬' },
            ]
        },{
            data: [
                { name: '听讲', value: 4 },
                { name: '举手', value: 6 },
                { name: '操作', value: 8 },
                { name: '分神', value: 10 },
                { name: '回答', value: 11 },
                { name: '读写', value: 15 },
                { name: '趴桌', value: 3 },
                { name: '讨论', value: 4 },
            ]
        },{
            data: [
                { name: '0-40%', value: 5 },
                { name: '40-60%', value: 5 },
                { name: '60-80%', value: 5 },
                { name: '80-90%', value: 10 },
                { name: '90%以上', value: 45 },
            ]
        },{
            xAxis: {
                data: ['2', '4', '6', '8', '10', '12', '14', '16', '18', '20', '22', '24', '26', '28', '30', '32', '34', '36', '38', '40']
            },
            series: [
                {
                    name: '参与度',
                    data: [120, 132, 101, 134, 90, 230, 210, 220, 182, 191, 234, 290, 330, 310, 150, 232, 201, 154, 190, 330, 410]
                },{
                    name: '凝聚度',
                    data: [220, 182, 191, 234, 290, 330, 310, 120, 132, 101, 134, 90, 230, 210, 150, 232, 201, 154, 190, 330, 410]
                },{
                    name: '专业度',
                    data:  [150, 232, 201, 154, 190, 330, 410, 120, 132, 101, 134, 90, 230, 210, 220, 182, 191, 234, 290, 330, 310]
                }
            ]
        },
        [{
            report: `
            总体来看，这节课的提问策略较为平衡，既注重基础认知问题，也涉及高级认知问题。学生的行为分析显示，大部分学生在课堂上表现出较高的专注度和参与度。然而，举手行为较少，可能需要教师采取措施鼓励学生更加积极地参与课堂互动。同时，课堂参与度/凝聚度/专注度的变化情况需要更多数据来进一步分析。
            `
        }]
    ],

    [
        {
            data: [
                { name: '识记型', value: 5 },
                { name: '理解型', value: 6 },
                { name: '应用型', value: 10 },
                { name: '分析型', value: 8 },
                { name: '评价型', value: 5 },
                { name: '创新型', value: 2 }
            ]
        },{
            dataset: {
                dimensions: ['product', '集体应答', '个别应答'],
                source: [
                    ['创新型', 1,2,3],
                    ['评价型', 3,4,5],
                    ['理解型', 1,3,5],
                    ['分析型', 1,4,5],
                    ['应用型', 2,3,5],
                    ['识记型', 2,6,5],
                ]
            }
        },{
            series: {
                data: [
                    { value: 1548, name: '补充' },
                    { value: 775, name: '表扬' },
                ]
            },
            data: [
                { value: 9, name: '表扬补充' },
                { value: 27, name: '老师补充' },
                { value: 9, name: '倾听表扬' },
                { value: 55, name: '简单表扬' },
            ]
        },{
            data: [
                { name: '听讲', value: 4 },
                { name: '举手', value: 6 },
                { name: '操作', value: 8 },
                { name: '分神', value: 10 },
                { name: '回答', value: 11 },
                { name: '读写', value: 15 },
                { name: '趴桌', value: 3 },
                { name: '讨论', value: 4 },
            ]
        },{
            data: [
                { name: '0-40%', value: 5 },
                { name: '40-60%', value: 5 },
                { name: '60-80%', value: 5 },
                { name: '80-90%', value: 10 },
                { name: '90%以上', value: 45 },
            ]
        },{
            xAxis: {
                data: ['2', '4', '6', '8', '10', '12', '14', '16', '18', '20', '22', '24', '26', '28', '30', '32', '34', '36', '38', '40']
            },
            series: [
                {
                    name: '参与度',
                    data: [120, 132, 101, 134, 90, 230, 210, 220, 182, 191, 234, 290, 330, 310, 150, 232, 201, 154, 190, 330, 410]
                },{
                    name: '凝聚度',
                    data: [220, 182, 191, 234, 290, 330, 310, 120, 132, 101, 134, 90, 230, 210, 150, 232, 201, 154, 190, 330, 410]
                },{
                    name: '专业度',
                    data:  [150, 232, 201, 154, 190, 330, 410, 120, 132, 101, 134, 90, 230, 210, 220, 182, 191, 234, 290, 330, 310]
                }
            ]
        },
        [{
            report: `
            总体来看，这节课的提问策略较为平衡，既注重基础认知问题，也涉及高级认知问题。学生的行为分析显示，大部分学生在课堂上表现出较高的专注度和参与度。然而，举手行为较少，可能需要教师采取措施鼓励学生更加积极地参与课堂互动。同时，课堂参与度/凝聚度/专注度的变化情况需要更多数据来进一步分析。
            `
        }]
    ],

    [
        {
            data: [
                { name: '识记型', value: 5 },
                { name: '理解型', value: 6 },
                { name: '应用型', value: 10 },
                { name: '分析型', value: 8 },
                { name: '评价型', value: 5 },
                { name: '创新型', value: 2 }
            ]
        },{
            dataset: {
                dimensions: ['product', '集体应答', '个别应答'],
                source: [
                    ['创新型', 1,2,3],
                    ['评价型', 3,4,5],
                    ['理解型', 1,3,5],
                    ['分析型', 1,4,5],
                    ['应用型', 2,3,5],
                    ['识记型', 2,6,5],
                ]
            }
        },{
            series: {
                data: [
                    { value: 1548, name: '补充' },
                    { value: 775, name: '表扬' },
                ]
            },
            data: [
                { value: 9, name: '表扬补充' },
                { value: 27, name: '老师补充' },
                { value: 9, name: '倾听表扬' },
                { value: 55, name: '简单表扬' },
            ]
        },{
            data: [
                { name: '听讲', value: 4 },
                { name: '举手', value: 6 },
                { name: '操作', value: 8 },
                { name: '分神', value: 10 },
                { name: '回答', value: 11 },
                { name: '读写', value: 15 },
                { name: '趴桌', value: 3 },
                { name: '讨论', value: 4 },
            ]
        },{
            data: [
                { name: '0-40%', value: 5 },
                { name: '40-60%', value: 5 },
                { name: '60-80%', value: 5 },
                { name: '80-90%', value: 10 },
                { name: '90%以上', value: 45 },
            ]
        },{
            xAxis: {
                data: ['2', '4', '6', '8', '10', '12', '14', '16', '18', '20', '22', '24', '26', '28', '30', '32', '34', '36', '38', '40']
            },
            series: [
                {
                    name: '参与度',
                    data: [120, 132, 101, 134, 90, 230, 210, 220, 182, 191, 234, 290, 330, 310, 150, 232, 201, 154, 190, 330, 410]
                },{
                    name: '凝聚度',
                    data: [220, 182, 191, 234, 290, 330, 310, 120, 132, 101, 134, 90, 230, 210, 150, 232, 201, 154, 190, 330, 410]
                },{
                    name: '专业度',
                    data:  [150, 232, 201, 154, 190, 330, 410, 120, 132, 101, 134, 90, 230, 210, 220, 182, 191, 234, 290, 330, 310]
                }
            ]
        },
        [{
            report: `
            总体来看，这节课的提问策略较为平衡，既注重基础认知问题，也涉及高级认知问题。学生的行为分析显示，大部分学生在课堂上表现出较高的专注度和参与度。然而，举手行为较少，可能需要教师采取措施鼓励学生更加积极地参与课堂互动。同时，课堂参与度/凝聚度/专注度的变化情况需要更多数据来进一步分析。
            `
        }]
    ],

    [
        {
            data: [
                { name: '识记型', value: 5 },
                { name: '理解型', value: 6 },
                { name: '应用型', value: 10 },
                { name: '分析型', value: 8 },
                { name: '评价型', value: 5 },
                { name: '创新型', value: 2 }
            ]
        },{
            dataset: {
                dimensions: ['product', '集体应答', '个别应答'],
                source: [
                    ['创新型', 1,2,3],
                    ['评价型', 3,4,5],
                    ['理解型', 1,3,5],
                    ['分析型', 1,4,5],
                    ['应用型', 2,3,5],
                    ['识记型', 2,6,5],
                ]
            }
        },{
            series: {
                data: [
                    { value: 1548, name: '补充' },
                    { value: 775, name: '表扬' },
                ]
            },
            data: [
                { value: 9, name: '表扬补充' },
                { value: 27, name: '老师补充' },
                { value: 9, name: '倾听表扬' },
                { value: 55, name: '简单表扬' },
            ]
        },{
            data: [
                { name: '听讲', value: 4 },
                { name: '举手', value: 6 },
                { name: '操作', value: 8 },
                { name: '分神', value: 10 },
                { name: '回答', value: 11 },
                { name: '读写', value: 15 },
                { name: '趴桌', value: 3 },
                { name: '讨论', value: 4 },
            ]
        },{
            data: [
                { name: '0-40%', value: 5 },
                { name: '40-60%', value: 5 },
                { name: '60-80%', value: 5 },
                { name: '80-90%', value: 10 },
                { name: '90%以上', value: 45 },
            ]
        },{
            xAxis: {
                data: ['2', '4', '6', '8', '10', '12', '14', '16', '18', '20', '22', '24', '26', '28', '30', '32', '34', '36', '38', '40']
            },
            series: [
                {
                    name: '参与度',
                    data: [120, 132, 101, 134, 90, 230, 210, 220, 182, 191, 234, 290, 330, 310, 150, 232, 201, 154, 190, 330, 410]
                },{
                    name: '凝聚度',
                    data: [220, 182, 191, 234, 290, 330, 310, 120, 132, 101, 134, 90, 230, 210, 150, 232, 201, 154, 190, 330, 410]
                },{
                    name: '专业度',
                    data:  [150, 232, 201, 154, 190, 330, 410, 120, 132, 101, 134, 90, 230, 210, 220, 182, 191, 234, 290, 330, 310]
                }
            ]
        },
        [{
            report: `
            总体来看，这节课的提问策略较为平衡，既注重基础认知问题，也涉及高级认知问题。学生的行为分析显示，大部分学生在课堂上表现出较高的专注度和参与度。然而，举手行为较少，可能需要教师采取措施鼓励学生更加积极地参与课堂互动。同时，课堂参与度/凝聚度/专注度的变化情况需要更多数据来进一步分析。
            `
        }]
    ]
]