export default [
    /**
     * 一：预检IACC系统不响应
     */
    [
        {
            data: [
                { value: 16, name: '良好率' },
                { value: 83, name: '优秀率' },
                { value: 32, name: '及格率' },
            ]
        },{
            data: [
                { value: 16, name: '命令运用' },
                { value: 83, name: '创建低模' },
                { value: 32, name: '熟悉软件' },
            ]
        },{
            data: [
                { value: 16, name: '良好率' },
                { value: 83, name: '优秀率' },
                { value: 32, name: '及格率' },
            ]
        },{
            data: [
                { value: 16, name: '抖音' },
                { value: 18, name: '快手' },
                { value: 30, name: '微博' },
                { value: 28, name: '微信' },
                { value: 20, name: '知乎' },
                { value: 22, name: '闲鱼' },
            ]
        },{
            label: ['第一组', '第二组', '第三组', '第四组', '第五组'],
            data: [
                {
                    name: '一',
                    type: 'line',
                    value: [1,2,3,4,5]
                },{
                    name: '二',
                    type: 'line',
                    value: [1,2,3,4,5]
                },{
                    name: '三',
                    type: 'line',
                    value: [1,2,3,4,5]
                },{
                    name: '四',
                    type: 'line',
                    value: [1,2,3,4,5]
                },{
                    name: '五',
                    type: 'line',
                    value: [1,2,3,4,5]
                }
            ]
        },{
            label: ['项目一', '项目二', '项目三', '项目四', '项目五', '项目六', '项目七', '项目八', '项目九', '项目十'],
            name: ['一'],
            data: [1,2,3,4,5,6,7,8,9,10]
        }
    ],
    /**
     * 二：检测IACC电路及通讯故障
     */
    [
        {
            name: ['Name'],
            data: ['100']
        },{
            name: ['Name'],
            data: ['100']
        },{
            name: ['Name'],
            data: ['100']
        },{
            label: ['驯鹿', '火箭', '飞机', '高铁', '轮船', '汽车', '跑步', '步行'],
            data: [123, 60, 25, 18, 12, 9, 2, 1]
        },{
            lebel: ['第一组', '第二组', '第三组', '第四组', '第五组'],
            legend: ['制作流程','操作规范','模型结构','模型比例'],
            series: [
                {
                    name: '制作流程',
                    type: 'line',
                    data: [1,2,3,4,5]
                },{
                    name: '操作规范',
                    type: 'line',
                    data: [1,2,3,4,5]
                },{
                    name: '模型结构',
                    type: 'line',
                    data: [1,2,3,4,5]
                },{
                    name: '模型比例',
                    type: 'line',
                    data: [1,2,3,4,5]
                },
            ]
        },{
            lebel: ['第一组', '第二组', '第三组', '第四组', '第五组'],
            legend: ['制作流程','操作规范','模型结构','模型比例'],
            series: [
                {
                    name: '制作流程',
                    type: 'bar',
                    data: [1,2,3,4,5]
                },{
                    name: '操作规范',
                    type: 'bar',
                    data: [1,2,3,4,5]
                },{
                    name: '模型结构',
                    type: 'bar',
                    data: [1,2,3,4,5]
                },{
                    name: '模型比例',
                    type: 'bar',
                    data: [1,2,3,4,5]
                },
            ]
        }
    ],
    /**
     * 三：维修IACC电路及通讯故障
     */
    [
        {
            data: [
                { value: 16, name: '良好率' },
                { value: 83, name: '优秀率' },
                { value: 32, name: '及格率' },
            ]
        },{
            data: [
                { value: 16, name: '命令运用' },
                { value: 83, name: '创建低模' },
                { value: 32, name: '熟悉软件' },
            ]
        },{
            data: [
                { value: 335, name: '微信' },
                { value: 310, name: '微博' },
                { value: 274, name: '钉钉' },
                { value: 235, name: '知乎' },
                { value: 400, name: '淘宝' }
            ]
        },{
            label: ['微信', '抖音', '快手', '钉钉', '淘宝'],
            data: [
                { value: 60, name: '微信' },
                { value: 40, name: '抖音' },
                { value: 20, name: '快手' },
                { value: 80, name: '钉钉' },
                { value: 100, name: '淘宝' }
            ]
        },{
            legend: ['完成湖面建模','完成图片收集'],
            label: ['第一组', '第二组', '第三组', '第四组', '第五组'],
            data: [
                {
                    name: '完成湖面建模',
                    type: 'line',
                    value: [1,2,3,4,5]
                },{
                    name: '完成图片收集',
                    type: 'line',
                    value: [1,2,3,4,5]
                }
            ]
        },{
            lebel: ['第一组', '第二组', '第三组', '第四组', '第五组'],
            legend: ['模块应用不足','层次认识不足','不熟悉编辑器','制作简单动画'],
            series: [
                {
                    name: '模块应用不足',
                    type: 'bar',
                    data: [1,2,3,4,5]
                },{
                    name: '层次认识不足',
                    type: 'bar',
                    data: [1,2,3,4,5]
                },{
                    name: '不熟悉编辑器',
                    type: 'bar',
                    data: [1,2,3,4,5]
                },{
                    name: '制作简单动画',
                    type: 'bar',
                    data: [1,2,3,4,5]
                },
            ]
        }
    ],
    /**
     * 四：验证IACC功能正常激活
     */
    [
        {
            data: [
                { value: 16, name: '良好率' },
                { value: 83, name: '优秀率' },
                { value: 32, name: '及格率' },
            ]
        },{
            data: [
                { value: 16, name: '命令运用' },
                { value: 83, name: '创建低模' },
                { value: 32, name: '熟悉软件' },
            ]
        },{
            data: [
                { value: 16, name: '良好率' },
                { value: 83, name: '优秀率' },
                { value: 32, name: '及格率' },
            ]
        },{
            data: [
                { value: 16, name: '抖音' },
                { value: 18, name: '快手' },
                { value: 30, name: '微博' },
                { value: 28, name: '微信' },
                { value: 20, name: '知乎' },
                { value: 22, name: '闲鱼' },
            ]
        },{
            lebel: ['第一组', '第二组', '第三组', '第四组', '第五组'],
            legend: ['制作流程','操作规范','模型结构','模型比例'],
            series: [
                {
                    name: '制作流程',
                    type: 'bar',
                    data: [1,2,3,4,5]
                },{
                    name: '操作规范',
                    type: 'bar',
                    data: [1,2,3,4,5]
                },{
                    name: '模型结构',
                    type: 'bar',
                    data: [1,2,3,4,5]
                },{
                    name: '模型比例',
                    type: 'bar',
                    data: [1,2,3,4,5]
                },
            ]
        },{
            legend: ['会简单布光','分辨不清光','理解不到位','能制作动效'],
            label: ['第一组', '第二组', '第三组', '第四组', '第五组', '第六组', '第七组', '第八组', '第九组', '第十组'],
            data: [
                [100, 302, 301, 334, 390, 330, 320, 390, 330, 320],
                [320, 132, 101, 134, 90, 230, 210, 90, 230, 210],
                [220, 182, 191, 234, 290, 330, 310, 290, 330, 310],
                [150, 212, 201, 154, 190, 330, 410,190, 330, 410],
            ]
        }
    ],
    /**
     * 五：预检报IACC系统故障
     */
    [
        {
            legend: ['装备模块','骨骼创建'],
            label: ['项目一', '项目二', '项目三', '项目四', '项目五'],
            series: [
                {
                    type: 'bar',
                    name: '装备模块',
                    data: [1,2,3,4,5]
                },{
                    type: 'bar',
                    name: '骨骼创建',
                    data: [1,2,3,4,5]
                }
            ]
        },{
            legend: ['使用控制器','调整角色权重'],
            label: ['项目一', '项目二', '项目三', '项目四', '项目五'],
            series: [
                {
                    type: 'bar',
                    name: '使用控制器',
                    data: [1,2,3,4,5]
                },{
                    type: 'bar',
                    name: '调整角色权重',
                    data: [1,2,3,4,5]
                }
            ]
        },{
            data: [
                { value: 335, name: '微信' },
                { value: 310, name: '微博' },
                { value: 274, name: '钉钉' },
                { value: 235, name: '知乎' },
                { value: 400, name: '淘宝' }
            ]
        },{
            legend: ['完成湖面建模','完成图片收集'],
            label: ['第一组', '第二组', '第三组', '第四组', '第五组'],
            data: [
                {
                    name: '完成湖面建模',
                    type: 'line',
                    value: [1,2,3,4,5]
                },{
                    name: '完成图片收集',
                    type: 'line',
                    value: [1,2,3,4,5]
                }
            ]
        },{
            label: ['项目一', '项目二', '项目三', '项目四', '项目五', '项目六', '项目七', '项目八', '项目九', '项目十'],
            name: ['一'],
            data: [1,2,3,4,5,6,7,8,9,10]
        }
    ],
    /**
     * 六：检测IACC控制器及关联系统
     */
    [
        {
            data: [
                { value: 16, name: '良好率' },
                { value: 83, name: '优秀率' },
                { value: 32, name: '及格率' },
            ]
        },{
            data: [
                { value: 16, name: '命令运用' },
                { value: 83, name: '创建低模' },
                { value: 32, name: '熟悉软件' },
            ]
        },{
            data: [
                { value: 16, name: '良好率' },
                { value: 83, name: '优秀率' },
                { value: 32, name: '及格率' },
            ]
        },{
            data: [
                { value: 16, name: '抖音' },
                { value: 18, name: '快手' },
                { value: 30, name: '微博' },
                { value: 28, name: '微信' },
                { value: 20, name: '知乎' },
                { value: 22, name: '闲鱼' },
            ]
        },{
            label: ['项目一', '项目二', '项目三', '项目四', '项目五'],
            legend: ['摄像机的作用','镜头的虚拟化','摄像机的创建','画面的定帧'],
            data: [
                [100, 302, 301, 334],
                [320, 132, 101, 134],
                [220, 182, 191, 234],
                [150, 212, 201, 154],
            ]
        },{
            label: ['项目一', '项目二', '项目三', '项目四', '项目五', '项目六', '项目七', '项目八', '项目九', '项目十'],
            name: ['一'],
            data: [1,2,3,4,5,6,7,8,9,10]
        }
    ],
    /**
     * 七：维修IACC及关联系统故障
     */
    [
        {
            data: [
                { value: 16, name: '良好率' },
                { value: 83, name: '优秀率' },
                { value: 32, name: '及格率' },
            ]
        },{
            data: [
                { value: 16, name: '命令运用' },
                { value: 83, name: '创建低模' },
                { value: 32, name: '熟悉软件' },
            ]
        },{
            lagend: ['调整阴影','路径动画'],
            label: ['Mon', 'Tue', 'Wed', 'Thu', 'Fri'],
            data: [
                {
                    name: '调整阴影',
                    type: 'line',
                    value: [1,2,3,4,5]
                },{
                    name: '路径动画',
                    type: 'line',
                    value: [1,2,3,4,5]
                }
            ]
        },{
            data: [
                { value: 335, name: '微信' },
                { value: 310, name: '微博' },
                { value: 274, name: '钉钉' },
                { value: 235, name: '知乎' },
                { value: 400, name: '淘宝' }
            ]
        },{
            legend: ['完成湖面建模','完成图片收集'],
            label: ['第一组', '第二组', '第三组', '第四组', '第五组'],
            data: [
                {
                    name: '完成湖面建模',
                    type: 'line',
                    value: [1,2,3,4,5]
                },{
                    name: '完成图片收集',
                    type: 'line',
                    value: [1,2,3,4,5]
                }
            ]
        },{
            label: ['项目一', '项目二', '项目三', '项目四', '项目五', '项目六', '项目七', '项目八', '项目九', '项目十'],
            name: ['一'],
            data: [1,2,3,4,5,6,7,8,9,10]
        }
    ],
    /**
     * 八：标定和验证IACC系统功能
     */
    [
        {
            data: [
                { value: 16, name: '良好率' },
                { value: 83, name: '优秀率' },
                { value: 32, name: '及格率' },
            ]
        },{
            label: ['项目一', '项目二', '项目三', '项目四', '项目五'],
            legend: ['摄像机的作用','镜头的虚拟化','摄像机的创建','画面的定帧'],
            data: [
                [100, 302, 301, 334,122],
                [320, 132, 101, 134,122],
                [220, 182, 191, 234,122],
                [150, 212, 201, 154,122],
            ]
        },{
            data: [
                { value: 16, name: '抖音' },
                { value: 18, name: '快手' },
                { value: 30, name: '微博' },
                { value: 28, name: '微信' },
                { value: 20, name: '知乎' },
                { value: 22, name: '闲鱼' },
            ]
        },{
            legend: ['完成湖面建模','完成图片收集'],
            label: ['第一组', '第二组', '第三组', '第四组', '第五组'],
            data: [
                {
                    name: '完成湖面建模',
                    type: 'line',
                    value: [1,2,3,4,5]
                },{
                    name: '完成图片收集',
                    type: 'line',
                    value: [1,2,3,4,5]
                }
            ]
        },{
            label: ['项目一', '项目二', '项目三', '项目四', '项目五', '项目六', '项目七', '项目八', '项目九', '项目十'],
            name: ['一'],
            data: [1,2,3,4,5,6,7,8,9,10]
        }
    ]
]